Белгипрозем_2017/src/InformationRegisters/ДокументооборотПользователиГруппДоступа/ДокументооборотПользователиГруппДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументооборотПользователиГруппДоступа</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администраторы</name>
      <description>Администраторы</description>
    </items>
  </predefined>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Только для персональных групп доступа</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <type>
        <types>Characteristic.ВидыДоступа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/ДокументооборотПользователиГруппДоступа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьВсе() Экспорт
	
	// Удаление всех записей регистра
	НаборЗаписей = РегистрыСведений.ДокументооборотПользователиГруппДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбновитьПоГруппеДоступа(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьПоГруппеДоступа(ГруппаДоступа) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДокументооборотПользователиГруппДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппаДоступа.Установить(ГруппаДоступа);
	НаборЗаписей.Записать();
	
	Для каждого Эл Из ГруппаДоступа.Пользователи Цикл
		
		Если ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
			НаборЗаписей = РегистрыСведений.ДокументооборотПользователиГруппДоступа.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ГруппаДоступа.Установить(ГруппаДоступа);
			НаборЗаписей.Отбор.Пользователь.Установить(Эл.Пользователь);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Пользователь = Эл.Пользователь;
			НоваяЗапись.ГруппаДоступа = ГруппаДоступа;
			
			НаборЗаписей.Записать();
			
		ИначеЕсли ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда	
			
			ПользователиГруппы = ДокументооборотПраваДоступаПовтИсп.ПолучитьСоставГруппыПользователей(Эл.Пользователь);
			
			Для каждого ПользовательГруппы Из ПользователиГруппы Цикл
				
				НаборЗаписей = РегистрыСведений.ДокументооборотПользователиГруппДоступа.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ГруппаДоступа.Установить(ГруппаДоступа);
				НаборЗаписей.Отбор.Пользователь.Установить(ПользовательГруппы.Пользователь);
			
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Пользователь = ПользовательГруппы.Пользователь;
				НоваяЗапись.ГруппаДоступа = ГруппаДоступа;
			
				НаборЗаписей.Записать();
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
